Infineon/amazon-freertos/vendors/infineon/boards/xmc4700_relaxkit/aws_tests/application_code/infineon_code/RTE_Device.h
/*
 * Copyright (c) 2015-2020, Infineon Technologies AG
 * All rights reserved.                        
 *                                             
 * Boost Software License - Version 1.0 - August 17th, 2003
 * 
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 * 
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer,
 * must be included in all copies of the Software, in whole or in part, and
 * all derivative works of the Software, unless such copies or derivative
 * works are solely in the form of machine-executable object code generated by
 * a source language processor.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *                                                                              
 * To improve the quality of the software, users are encouraged to share 
 * modifications, enhancements or bug fixes with Infineon Technologies AG 
 * at XMCSupport@infineon.com.
 *
 */

/**
 * @file RTE_Device.h
 * @date 16 Dec., 2019
 * @version 1.2.0
 *
 * @brief RTE Device Configuration for Infineon XMC48/47_F144
 *
 * History
 *
 * Version 1.0.0 
 * - Initial version
 *
 * Version 1.0.2
 * - Changed ETH pins defaults to match XMC4800 Relax Kit boards
 *
 * Version 1.1.0
 * - [New] MCI, CAN and SAI drivers 
 * - [Changed] Limit RX and TX FIFO sum of single channel to 32 entries
 * - [Fixed] Several pin configurations fixed.
 *
 * Version 1.2.0
 * - [New] Added IRQ priority setting for drivers
 * - [New] Added Hold delay option for I2C driver
 *
 */

//-------- <<< Use Configuration Wizard in Context Menu >>> --------------------

#ifndef __RTE_DEVICE_H
#define __RTE_DEVICE_H

#include "xmc_device.h"
#include "xmc4_gpio_map.h"
#include "xmc4_usic_map.h"
#include "xmc_can_map.h"

#define NO_FIFO 0
#define FIFO_SIZE_2 1
#define FIFO_SIZE_4 2
#define FIFO_SIZE_8 3
#define FIFO_SIZE_16 4
#define FIFO_SIZE_32 5

// <e> CAN0 (Controller area network) [Driver_CAN0]
// <i> Configuration settings for Driver_CAN0 in component ::Drivers:CAN
#define RTE_CAN0                      0

//   <o> CAN0 TX Pin <0=>P0_0 <1=>P1_4 <2=>P2_0 <3=>P3_2 <4=>P3_10
#define RTE_CAN0_TX_ID                0
#if    (RTE_CAN0_TX_ID == 0)
#define RTE_CAN0_TX_PORT              P0_0
#define RTE_CAN0_TX_AF                P0_0_AF_CAN_N0_TXD
#elif  (RTE_CAN0_TX_ID == 1)
#define RTE_CAN0_TX_PORT              P1_4
#define RTE_CAN0_TX_AF                P1_4_AF_CAN_N0_TXD
#elif  (RTE_CAN0_TX_ID == 2)
#define RTE_CAN0_TX_PORT              P2_0
#define RTE_CAN0_TX_AF                P2_0_AF_CAN_N0_TXD
#elif  (RTE_CAN0_TX_ID == 3)
#define RTE_CAN0_TX_PORT              P3_2
#define RTE_CAN0_TX_AF                P3_2_AF_CAN_N0_TXD
#elif  (RTE_CAN0_TX_ID == 4)
#define RTE_CAN0_TX_PORT              P3_10
#define RTE_CAN0_TX_AF                P3_10_AF_CAN_N0_TXD
#else
#error "Invalid CAN0_TX Pin Configuration!"
#endif

//   <o> CAN0 RX Pin <0=>P1_5 <1=>P3_12 <2=>P14_3
#define RTE_CAN0_RX_ID                0
#if    (RTE_CAN0_RX_ID == 0)
#define RTE_CAN0_RX_PORT              P1_5
#define RTE_CAN0_RX_INPUT             CAN_NODE0_RXD_P1_5
#elif  (RTE_CAN0_RX_ID == 1)
#define RTE_CAN0_RX_PORT              P3_12
#define RTE_CAN0_RX_INPUT             CAN_NODE0_RXD_P3_12
#elif  (RTE_CAN0_RX_ID == 2)
#define RTE_CAN0_RX_PORT              P14_3
#define RTE_CAN0_RX_INPUT             CAN_NODE0_RXD_P14_3
#else
#error "Invalid CAN0_RX Pin Configuration!"
#endif

// <o>IRQ Priority <0-63>
// <i> Defines priority of CAN events IRQ handling
// <i> Default: 63
#define RTE_CAN0_IRQ_PRIORITY  63

// </e>

// <e> CAN1 (Controller area network) [Driver_CAN1]
// <i> Configuration settings for Driver_CAN1 in component ::Drivers:CAN
#define RTE_CAN1                      0

//   <o> CAN1 TX Pin <0=>P1_5 <1=>P1_12 <2=>P2_7 <3=>P3_9
#define RTE_CAN1_TX_ID                0
#if    (RTE_CAN1_TX_ID == 0)
#define RTE_CAN1_TX_PORT              P1_5
#define RTE_CAN1_TX_AF                P1_5_AF_CAN_N1_TXD
#elif  (RTE_CAN1_TX_ID == 1)
#define RTE_CAN1_TX_PORT              P1_12
#define RTE_CAN1_TX_AF                P1_12_AF_CAN_N1_TXD
#elif  (RTE_CAN1_TX_ID == 2)
#define RTE_CAN1_TX_PORT              P2_7
#define RTE_CAN1_TX_AF                P2_7_AF_CAN_N1_TXD
#elif  (RTE_CAN1_TX_ID == 3)
#define RTE_CAN1_TX_PORT              P3_9
#define RTE_CAN1_TX_AF                P3_9_AF_CAN_N1_TXD
#else
#error "Invalid CAN1_TX Pin Configuration!"
#endif

//   <o> CAN1 RX Pin <0=>P1_4 <1=>P1_13 <2=>P2_6 <3=>P3_11
#define RTE_CAN1_RX_ID                0
#if    (RTE_CAN1_RX_ID == 0)
#define RTE_CAN1_RX_PORT              P1_4
#define RTE_CAN1_RX_INPUT             CAN_NODE1_RXD_P1_4
#elif  (RTE_CAN1_RX_ID == 1)
#define RTE_CAN1_RX_PORT              P1_13
#define RTE_CAN1_RX_INPUT             CAN_NODE1_RXD_P1_13
#elif  (RTE_CAN1_RX_ID == 2)
#define RTE_CAN1_RX_PORT              P2_6
#define RTE_CAN1_RX_INPUT             CAN_NODE1_RXD_P2_6
#elif  (RTE_CAN1_RX_ID == 3)
#define RTE_CAN1_RX_PORT              P3_11
#define RTE_CAN1_RX_INPUT             CAN_NODE1_RXD_P3_11
#else
#error "Invalid CAN1_RX Pin Configuration!"
#endif

// <o>IRQ Priority <0-63>
// <i> Defines priority of CAN events IRQ handling
// <i> Default: 63
#define RTE_CAN1_IRQ_PRIORITY  63

// </e>

// <e> CAN2 (Controller area network) [Driver_CAN2]
// <i> Configuration settings for Driver_CAN2 in component ::Drivers:CAN
#define RTE_CAN2                      0

//   <o> CAN2 TX Pin <0=>P1_9 <1=>P3_7 <2=>P4_7
#define RTE_CAN2_TX_ID                0
#if    (RTE_CAN2_TX_ID == 0)
#define RTE_CAN2_TX_PORT              P1_9
#define RTE_CAN2_TX_AF                P1_9_AF_CAN_N2_TXD
#elif  (RTE_CAN2_TX_ID == 1)
#define RTE_CAN2_TX_PORT              P3_7
#define RTE_CAN2_TX_AF                P3_7_AF_CAN_N2_TXD
#elif  (RTE_CAN2_TX_ID == 2)
#define RTE_CAN2_TX_PORT              P4_7
#define RTE_CAN2_TX_AF                P4_7_AF_CAN_N2_TXD
#else
#error "Invalid CAN2_TX Pin Configuration!"
#endif

//   <o> CAN2 RX Pin <0=>P1_8 <1=>P3_8 <2=>P4_6
#define RTE_CAN2_RX_ID                0
#if    (RTE_CAN2_RX_ID == 0)
#define RTE_CAN2_RX_PORT              P1_8
#define RTE_CAN2_RX_INPUT             CAN_NODE2_RXD_P1_8
#elif  (RTE_CAN2_RX_ID == 1)
#define RTE_CAN2_RX_PORT              P3_8
#define RTE_CAN2_RX_INPUT             CAN_NODE2_RXD_P3_8
#elif  (RTE_CAN2_RX_ID == 2)
#define RTE_CAN2_RX_PORT              P4_6
#define RTE_CAN2_RX_INPUT             CAN_NODE2_RXD_P4_6
#else
#error "Invalid CAN2_RX Pin Configuration!"
#endif

// <o>IRQ Priority <0-63>
// <i> Defines priority of CAN events IRQ handling
// <i> Default: 63
#define RTE_CAN2_IRQ_PRIORITY  63

// </e>

// <e> CAN3 (Controller area network) [Driver_CAN3]
// <i> Configuration settings for Driver_CAN3 in component ::Drivers:CAN
#define RTE_CAN3                      0

//   <o> CAN3 TX Pin <0=>P4_0 <1=>P6_5
#define RTE_CAN3_TX_ID                0
#if    (RTE_CAN3_TX_ID == 0)
#define RTE_CAN3_TX_PORT              P4_0
#define RTE_CAN3_TX_AF                P4_0_AF_CAN_N3_TXD
#elif  (RTE_CAN3_TX_ID == 1)
#define RTE_CAN3_TX_PORT              P6_5
#define RTE_CAN3_TX_AF                P6_5_AF_CAN_N3_TXD
#else
#error "Invalid CAN3_TX Pin Configuration!"
#endif

//   <o> CAN3 RX Pin <0=>P0_8 <1=>P6_6
#define RTE_CAN3_RX_ID                0
#if    (RTE_CAN3_RX_ID == 0)
#define RTE_CAN3_RX_PORT              P0_8
#define RTE_CAN3_RX_INPUT             CAN_NODE3_RXD_P0_8
#elif  (RTE_CAN3_RX_ID == 1)
#define RTE_CAN3_RX_PORT              P6_6
#define RTE_CAN3_RX_INPUT             CAN_NODE3_RXD_P6_6
#else
#error "Invalid CAN3_RX Pin Configuration!"
#endif

// <o>IRQ Priority <0-63>
// <i> Defines priority of CAN events IRQ handling
// <i> Default: 63
#define RTE_CAN3_IRQ_PRIORITY  63

// </e>

// <e> CAN4 (Controller area network) [Driver_CAN4]
// <i> Configuration settings for Driver_CAN4 in component ::Drivers:CAN
#define RTE_CAN4                      0

//   <o> CAN4 TX Pin <0=>P2_14 <1=>P5_8
#define RTE_CAN4_TX_ID                0
#if    (RTE_CAN4_TX_ID == 0)
#define RTE_CAN4_TX_PORT              P2_14
#define RTE_CAN4_TX_AF                P2_14_AF_CAN_N4_TXD
#elif  (RTE_CAN4_TX_ID == 1)
#define RTE_CAN4_TX_PORT              P5_8
#define RTE_CAN4_TX_AF                P5_8_AF_CAN_N4_TXD
#else
#error "Invalid CAN4_TX Pin Configuration!"
#endif

