Infineon/amazon-freertos/vendors/infineon/boards/xmc4700_relaxkit/aws_tests/application_code/infineon_code/RTE_Device.h
//   <o> SPI3_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_SPI3_RX_FIFO_SIZE_ID                4
#if    (RTE_SPI3_RX_FIFO_SIZE_ID == 0)
#define RTE_SPI3_RX_FIFO_SIZE         NO_FIFO
#define RTE_SPI3_RX_FIFO_SIZE_NUM     0
#elif  (RTE_SPI3_RX_FIFO_SIZE_ID == 1)
#define RTE_SPI3_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_SPI3_RX_FIFO_SIZE_NUM     2
#elif  (RTE_SPI3_RX_FIFO_SIZE_ID == 2)
#define RTE_SPI3_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI3_RX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI3_RX_FIFO_SIZE_ID == 3)
#define RTE_SPI3_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_SPI3_RX_FIFO_SIZE_NUM     8
#elif  (RTE_SPI3_RX_FIFO_SIZE_ID == 4)
#define RTE_SPI3_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_SPI3_RX_FIFO_SIZE_NUM     16
#elif  (RTE_SPI3_RX_FIFO_SIZE_ID == 5)
#define RTE_SPI3_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_SPI3_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid SPI3_RX FIFO SIZE Configuration!"
#endif

//   <o> SPI3_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_SPI3_TX_FIFO_SIZE_ID                4
#if    (RTE_SPI3_TX_FIFO_SIZE_ID == 0)
#define RTE_SPI3_TX_FIFO_SIZE         NO_FIFO
#define RTE_SPI3_TX_FIFO_SIZE_NUM     0
#elif  (RTE_SPI3_TX_FIFO_SIZE_ID == 1)
#define RTE_SPI3_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_SPI3_TX_FIFO_SIZE_NUM     2
#elif  (RTE_SPI3_TX_FIFO_SIZE_ID == 2)
#define RTE_SPI3_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI3_TX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI3_TX_FIFO_SIZE_ID == 3)
#define RTE_SPI3_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_SPI3_TX_FIFO_SIZE_NUM     8
#elif  (RTE_SPI3_TX_FIFO_SIZE_ID == 4)
#define RTE_SPI3_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_SPI3_TX_FIFO_SIZE_NUM     16
#elif  (RTE_SPI3_TX_FIFO_SIZE_ID == 5)
#define RTE_SPI3_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_SPI3_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid SPI3_TX FIFO SIZE Configuration!"
#endif

// <o>IRQ Priority <0-63>
// <i> Defines priority of SPI events IRQ handling
// <i> Default: 63
#define RTE_SPI3_IRQ_PRIORITY  63

//</e>
// <e> SPI4 (Serial peripheral interface) [Driver_SPI4]
// <i> Configuration settings for Driver_SPI4 in component ::Drivers:SPI
#define RTE_SPI4                      0

//   <o> SPI4 TX MOSI(master) MISO(slave) Pin <0=>P3_8 <1=>P5_0 <2=>P6_6
#define RTE_SPI4_TX_ID                0
#if    (RTE_SPI4_TX_ID == 0)
#define RTE_SPI4_TX_PORT              P3_8
#define RTE_SPI4_TX_AF                P3_8_AF_U2C0_DOUT0
#elif  (RTE_SPI4_TX_ID == 1)
#define RTE_SPI4_TX_PORT              P5_0
#define RTE_SPI4_TX_AF                P5_0_AF_U2C0_DOUT0
#elif  (RTE_SPI4_TX_ID == 2)
#define RTE_SPI4_TX_PORT              P6_6
#define RTE_SPI4_TX_AF                P6_6_AF_U2C0_DOUT0
#else
#error "Invalid SPI4_TX Pin Configuration!"
#endif

//   <o> SPI4 RX MISO(master) MOSI(slave) Pin <0=>P3_7 <1=>P5_0 <2=>P5_1 <3=>P6_5
#define RTE_SPI4_RX_ID                0
#if    (RTE_SPI4_RX_ID == 0)
#define RTE_SPI4_RX_PORT              P3_7
#define RTE_SPI4_RX_INPUT             USIC2_C0_DX0_P3_7
#elif  (RTE_SPI4_RX_ID == 1)
#define RTE_SPI4_RX_PORT              P5_0
#define RTE_SPI4_RX_INPUT             USIC2_C0_DX0_P5_0
#elif  (RTE_SPI4_RX_ID == 2)
#define RTE_SPI4_RX_PORT              P5_1
#define RTE_SPI4_RX_INPUT             USIC2_C0_DX0_P5_1
#elif  (RTE_SPI4_RX_ID == 3)
#define RTE_SPI4_RX_PORT              P6_5
#define RTE_SPI4_RX_INPUT             USIC2_C0_DX0_P6_5
#else
#error "Invalid SPI4_RX Pin Configuration!"
#endif

//   <o> SPI4_CLK OUTPUT Pin <0=>P3_9 <1=>P5_2
#define RTE_SPI4_CLK_OUTPUT_ID                0
#if    (RTE_SPI4_CLK_OUTPUT_ID == 0)
#define RTE_SPI4_CLK_OUTPUT_PORT              P3_9
#define RTE_SPI4_CLK_AF                       P3_9_AF_U2C0_SCLKOUT
#elif  (RTE_SPI4_CLK_OUTPUT_ID == 1)
#define RTE_SPI4_CLK_OUTPUT_PORT              P5_2
#define RTE_SPI4_CLK_AF                       P5_2_AF_U2C0_SCLKOUT
#else
#error "Invalid SPI4 CLOCK OUTPUT Pin Configuration!"
#endif

//   <h> SPI4_SLAVE SELECT Pins 
// <e> SLAVE SELECT LINE 0
// <i> Enable slave select line 0
#define RTE_SPI4_SLAVE_SELECT_LINE0 0
//   <o> SPI4_SLAVE SELECT LINE 0 Pin <0=>P3_10 <1=>P5_3
#define RTE_SPI4_SLAVE_SELECT_LINE_0_ID                0
#if    (RTE_SPI4_SLAVE_SELECT_LINE_0_ID == 0)
#define RTE_SPI4_SLAVE_SELECT_LINE_0_PORT              P3_10
#define RTE_SPI4_SLAVE_SELECT_LINE_0_AF                P3_10_AF_U2C0_SELO0
#elif  (RTE_SPI4_SLAVE_SELECT_LINE_0_ID == 1)
#define RTE_SPI4_SLAVE_SELECT_LINE_0_PORT              P5_3
#define RTE_SPI4_SLAVE_SELECT_LINE_0_AF                P5_3_AF_U2C0_SELO0
#else
#error "Invalid SPI4 SLAVE SELECT LINE 0 Pin Configuration!"
#endif
// </e>

// <e> SLAVE SELECT LINE 1
// <i> Enable slave select line 1
#define RTE_SPI4_SLAVE_SELECT_LINE1 0
//   <o> SPI4_SLAVE SELECT LINE 1 Pin <0=>P5_4
#define RTE_SPI4_SLAVE_SELECT_LINE_1_ID                0
#if    (RTE_SPI4_SLAVE_SELECT_LINE_1_ID == 0)
#define RTE_SPI4_SLAVE_SELECT_LINE_1_PORT              P5_4
#define RTE_SPI4_SLAVE_SELECT_LINE_1_AF                P5_4_AF_U2C0_SELO1
#else
#error "Invalid SPI4 SLAVE SELECT LINE 1 Pin Configuration!"
#endif
// </e>

// <e> SLAVE SELECT LINE 2
// <i> Enable slave select line 2
#define RTE_SPI4_SLAVE_SELECT_LINE2 0
//   <o> SPI4_SLAVE SELECT LINE 2 Pin <0=>P5_5
#define RTE_SPI4_SLAVE_SELECT_LINE_2_ID                0
#if    (RTE_SPI4_SLAVE_SELECT_LINE_2_ID == 0)
#define RTE_SPI4_SLAVE_SELECT_LINE_2_PORT              P5_5
#define RTE_SPI4_SLAVE_SELECT_LINE_2_AF                P5_5_AF_U2C0_SELO2
#else
#error "Invalid SPI4 SLAVE SELECT LINE 2 Pin Configuration!"
#endif
// </e>

// <e> SLAVE SELECT LINE 3
// <i> Enable slave select line 3
#define RTE_SPI4_SLAVE_SELECT_LINE3 0
//   <o> SPI4_SLAVE SELECT LINE 3 Pin <0=>P5_6
#define RTE_SPI4_SLAVE_SELECT_LINE_3_ID                0
#if    (RTE_SPI4_SLAVE_SELECT_LINE_3_ID == 0)
#define RTE_SPI4_SLAVE_SELECT_LINE_3_PORT              P5_6
#define RTE_SPI4_SLAVE_SELECT_LINE_3_AF                P5_6_AF_U2C0_SELO3
#else
#error "Invalid SPI4 SLAVE SELECT LINE 3 Pin Configuration!"
#endif
// </e>

// <e> SLAVE SELECT LINE 4
// <i> Enable slave select line 4
#define RTE_SPI4_SLAVE_SELECT_LINE4 0
//   <o> SPI4_SLAVE SELECT LINE 4 Pin <0=>P2_6
#define RTE_SPI4_SLAVE_SELECT_LINE_4_ID                0
#if    (RTE_SPI4_SLAVE_SELECT_LINE_4_ID == 0)
#define RTE_SPI4_SLAVE_SELECT_LINE_4_PORT              P2_6
#define RTE_SPI4_SLAVE_SELECT_LINE_4_AF                P2_6_AF_U2C0_SELO4
#else
#error "Invalid SPI4 SLAVE SELECT LINE 4 Pin Configuration!"
#endif
// </e>
// </h>

//   <o> SPI4_CLK INPUT Pin <0=>P5_2
#define RTE_SPI4_CLK_INPUT_ID                0
#if    (RTE_SPI4_CLK_INPUT_ID == 0)
#define RTE_SPI4_CLK_INPUT_PORT              P5_2
#define RTE_SPI4_CLK_INPUT                   USIC2_C0_DX1_P5_2
#else
#error "Invalid SPI4 CLOCK INPUT Pin Configuration!"
#endif

