Infineon/amazon-freertos/vendors/infineon/boards/xmc4700_relaxkit/aws_tests/application_code/infineon_code/RTE_Device.h
// <e> Enable MCLK output
#define RTE_I2S3_MCLK_OUTPUT_ENABLE          0
//   <o> I2S3_MCLK OUTPUT Pin <0=>P4_1
#define RTE_I2S3_MCLK_OUTPUT_ID              0
#if    (RTE_I2S3_MCLK_OUTPUT_ID == 0)
#define RTE_I2S3_MCLK_OUTPUT_PORT            P4_1
#define RTE_I2S3_MCLK_AF                     P4_1_AF_U1C1_MCLKOUT
#else
#error "Invalid I2S3_MCLK Output Pin Configuration!"
#endif
// </e>

//   <o> I2S3_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_I2S3_RX_FIFO_SIZE_ID                4
#if    (RTE_I2S3_RX_FIFO_SIZE_ID == 0)
#define RTE_I2S3_RX_FIFO_SIZE         NO_FIFO
#define RTE_I2S3_RX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 1)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S3_RX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 2)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S3_RX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 3)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S3_RX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 4)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S3_RX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 5)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S3_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S3_RX FIFO SIZE Configuration!"
#endif

//   <o> I2S3_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_I2S3_TX_FIFO_SIZE_ID                4
#if    (RTE_I2S3_TX_FIFO_SIZE_ID == 0)
#define RTE_I2S3_TX_FIFO_SIZE         NO_FIFO
#define RTE_I2S3_TX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S3_TX_FIFO_SIZE_ID == 1)
#define RTE_I2S3_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S3_TX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S3_TX_FIFO_SIZE_ID == 2)
#define RTE_I2S3_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S3_TX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S3_TX_FIFO_SIZE_ID == 3)
#define RTE_I2S3_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S3_TX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S3_TX_FIFO_SIZE_ID == 4)
#define RTE_I2S3_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S3_TX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S3_TX_FIFO_SIZE_ID == 5)
#define RTE_I2S3_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S3_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S3_TX FIFO SIZE Configuration!"
#endif

// <o>IRQ Priority <0-63>
// <i> Defines priority of I2S events IRQ handling
// <i> Default: 63
#define RTE_I2S3_IRQ_PRIORITY  63

//</e>

// <e> I2S4 (Inter-Integrated Sound) [Driver_SAI4]
// <i> Configuration settings for Driver_SAI4 in component ::Drivers:SAI
#define RTE_I2S4                      0

//   <o> I2S4_TX Pin <0=>P3_8 <1=>P5_0 <2=>P6_6
#define RTE_I2S4_TX_ID                0
#if    (RTE_I2S4_TX_ID == 0)
#define RTE_I2S4_TX_PORT              P3_8
#define RTE_I2S4_TX_AF                P3_8_AF_U2C0_DOUT0
#elif  (RTE_I2S4_TX_ID == 1)
#define RTE_I2S4_TX_PORT              P5_0
#define RTE_I2S4_TX_AF                P5_0_AF_U2C0_DOUT0
#elif  (RTE_I2C4_TX_ID == 2)
#define RTE_I2C4_TX_PORT              P6_6
#define RTE_I2C4_TX_AF                P6_6_AF_U2C0_DOUT0
#else
#error "Invalid I2S4_TX Pin Configuration!"
#endif

//   <o> I2S4_RX Pin <0=>P3_7 <1=>P5_0 <2=>P5_1 <3=>P6_5
#define RTE_I2S4_RX_ID                0
#if    (RTE_I2S4_RX_ID == 0)
#define RTE_I2S4_RX_PORT              P3_7
#define RTE_I2S4_RX_INPUT             USIC2_C0_DX0_P3_7
#elif  (RTE_I2S4_RX_ID == 1)
#define RTE_I2S4_RX_PORT              P5_0
#define RTE_I2S4_RX_INPUT             USIC2_C0_DX0_P5_0
#elif  (RTE_I2S4_RX_ID == 2)
#define RTE_I2S4_RX_PORT              P5_1
#define RTE_I2S4_RX_INPUT             USIC2_C0_DX0_P5_1
#elif  (RTE_I2S4_RX_ID == 3)
#define RTE_I2S4_RX_PORT              P6_5
#define RTE_I2S4_RX_INPUT             USIC2_C0_DX0_P6_5
#else
#error "Invalid I2S4_RX Pin Configuration!"
#endif

//   <o> I2S4_CLK OUTPUT Pin <0=>P3_9 <1=>P5_2
#define RTE_I2S4_CLK_OUTPUT_ID                0
#if    (RTE_I2S4_CLK_OUTPUT_ID == 0)
#define RTE_I2S4_CLK_OUTPUT_PORT              P3_9
#define RTE_I2S4_CLK_AF                       P3_9_AF_U2C0_SCLKOUT
#elif  (RTE_I2S4_CLK_OUTPUT_ID == 1)
#define RTE_I2S4_CLK_OUTPUT_PORT              P5_2
#define RTE_I2S4_CLK_AF                       P5_2_AF_U2C0_SCLKOUT
#else
#error "Invalid I2S4 CLOCK OUTPUT Pin Configuration!"
#endif

//   <o> I2S4_CLK INPUT Pin <0=>P5_2
#define RTE_I2S4_CLK_INPUT_ID                0
#if    (RTE_I2S4_CLK_INPUT_ID == 0)
#define RTE_I2S4_CLK_INPUT_PORT              P5_2
#define RTE_I2S4_CLK_INPUT                   USIC2_C0_DX1_P5_2
#else
#error "Invalid I2S4 CLOCK INPUT Pin Configuration!"
#endif

//   <o> I2S4_WS OUTPUT Pin <0=>P3_10 <1=>P5_3
#define RTE_I2S4_WS_OUTPUT_ID                0
#if     (RTE_I2S4_WS_OUTPUT_ID == 0)
#define RTE_I2S4_WS_OUTPUT_PORT              P3_10
#define RTE_I2S4_WS_AF                       P3_10_AF_U2C0_SELO0
#elif   (RTE_I2S4_WS_OUTPUT_ID == 1)
#define RTE_I2S4_WS_OUTPUT_PORT              P5_3
#define RTE_I2S4_WS_AF                       P5_3_AF_U2C0_SELO0
#else
#error "Invalid I2S4_WS Output Pin Configuration!"
#endif

//   <o> I2S4_WS INPUT Pin <0=>P5_3
#define RTE_I2S4_WS_INPUT_ID                 0
#if    (RTE_I2S4_WS_INPUT_ID == 0)
#define RTE_I2S4_WS_INPUT_PORT               P5_3
#define RTE_I2S4_WS_INPUT_ID_INPUT           USIC2_C0_DX2_P5_3
#else
#error "Invalid I2S4_WS Input Pin Configuration!"
#endif

#define RTE_I2S4_MCLK_OUTPUT_ENABLE          0

//   <o> I2S4_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_I2S4_RX_FIFO_SIZE_ID                4
#if    (RTE_I2S4_RX_FIFO_SIZE_ID == 0)
#define RTE_I2S4_RX_FIFO_SIZE         NO_FIFO
#define RTE_I2S4_RX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S4_RX_FIFO_SIZE_ID == 1)
#define RTE_I2S4_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S4_RX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S4_RX_FIFO_SIZE_ID == 2)
#define RTE_I2S4_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S4_RX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S4_RX_FIFO_SIZE_ID == 3)
#define RTE_I2S4_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S4_RX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S4_RX_FIFO_SIZE_ID == 4)
#define RTE_I2S4_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S4_RX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S4_RX_FIFO_SIZE_ID == 5)
#define RTE_I2S4_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S4_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S4_RX FIFO SIZE Configuration!"
#endif

