Infineon/amazon-freertos/vendors/infineon/boards/xmc4700_relaxkit/aws_tests/application_code/infineon_code/RTE_Device.h
//</e>

// <e> ENET (Ethernet Interface) [Driver_ETH_MAC0]
// <i> Configuration settings for Driver_ETH_MAC0 in component ::Drivers:Ethernet MAC
#define   RTE_ENET                      0

//   <e> MII (Media Independent Interface)
#define   RTE_ENET_MII                  0

//     <o> TXD0 (Transmit data bit 0) pin 
//       <0=>P0_5
//       <1=>P1_13
//       <2=>P2_8
//       <3=>P2_12
#define   RTE_ENET_MII_TXD0_PIN_ID     0

#if (RTE_ENET_MII_TXD0_PIN_ID == 0)
 #define RTE_ENET_MII_TXD0_PIN  P0_5
 #define RTE_ENET_MII_TXD0_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MII_TXD0_PIN_ID == 1)
 #define RTE_ENET_MII_TXD0_PIN  P1_13
 #define RTE_ENET_MII_TXD0_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MII_TXD0_PIN_ID == 2)
 #define RTE_ENET_MII_TXD0_PIN  P2_8
 #define RTE_ENET_MII_TXD0_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MII_TXD0_PIN_ID == 3)
 #define RTE_ENET_MII_TXD0_PIN  P2_12
 #define RTE_ENET_MII_TXD0_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT4
#else
 #error "Invalid TXD0 pin!"
#endif

//     <o> TXD1 (Transmit data bit 1) pin 
//       <0=>P0_6
//       <1=>P1_14
//       <2=>P2_9
//       <3=>P2_13
#define   RTE_ENET_MII_TXD1_PIN_ID     0

#if (RTE_ENET_MII_TXD1_PIN_ID == 0)
 #define RTE_ENET_MII_TXD1_PIN  P0_6
 #define RTE_ENET_MII_TXD1_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MII_TXD1_PIN_ID == 1)
 #define RTE_ENET_MII_TXD1_PIN  P1_14
 #define RTE_ENET_MII_TXD1_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MII_TXD1_PIN_ID == 2)
 #define RTE_ENET_MII_TXD1_PIN  P2_9
 #define RTE_ENET_MII_TXD1_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MII_TXD1_PIN_ID == 3)
 #define RTE_ENET_MII_TXD1_PIN  P2_13
 #define RTE_ENET_MII_TXD1_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT4
#else
 #error "Invalid TXD1 pin!"
#endif

//     <o> TXD2 (Transmit data bit 2) pin 
//       <0=>P2_12
//       <1=>P6_0
#define   RTE_ENET_MII_TXD2_PIN_ID     0

#if (RTE_ENET_MII_TXD2_PIN_ID == 0)
 #define RTE_ENET_MII_TXD2_PIN  P2_12
 #define RTE_ENET_MII_TXD2_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MII_TXD2_PIN_ID == 1)
 #define RTE_ENET_MII_TXD2_PIN  P6_0
 #define RTE_ENET_MII_TXD2_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#else
 #error "Invalid TXD2 pin!"
#endif

//     <o> TXD3 (Transmit data bit 3) pin 
//       <0=>P2_13
//       <1=>P6_1
#define   RTE_ENET_MII_TXD3_PIN_ID     0

#if (RTE_ENET_MII_TXD3_PIN_ID == 0)
 #define RTE_ENET_MII_TXD3_PIN  P2_13
 #define RTE_ENET_MII_TXD3_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MII_TXD3_PIN_ID == 1)
 #define RTE_ENET_MII_TXD3_PIN  P6_1
 #define RTE_ENET_MII_TXD3_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#else
 #error "Invalid TXD3 pin!"
#endif

//     <o> TXEN (Transmit Enable) pin 
//       <0=>P0_4
//       <1=>P1_12
//       <2=>P2_5
//       <3=>P5_9
#define   RTE_ENET_MII_TXEN_PIN_ID     0

#if (RTE_ENET_MII_TXEN_PIN_ID == 0)
 #define RTE_ENET_MII_TXEN_PIN  P0_4
 #define RTE_ENET_MII_TXEN_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MII_TXEN_PIN_ID == 1)
 #define RTE_ENET_MII_TXEN_PIN  P1_12
 #define RTE_ENET_MII_TXEN_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MII_TXEN_PIN_ID == 2)
 #define RTE_ENET_MII_TXEN_PIN  P2_5
 #define RTE_ENET_MII_TXEN_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MII_TXEN_PIN_ID == 3)
 #define RTE_ENET_MII_TXEN_PIN  P5_9
 #define RTE_ENET_MII_TXEN_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT4
#else
 #error "Invalid TXEN pin!"
#endif

//     <o> TXER (Transmit Error) pin 
//       <0=>P2_11
//       <1=>P6_2
#define   RTE_ENET_MII_TXER_PIN_ID     0

#if (RTE_ENET_MII_TXER_PIN_ID == 0)
 #define RTE_ENET_MII_TXER_PIN  P2_11
 #define RTE_ENET_MII_TXER_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#elif (RTE_ENET_MII_TXER_PIN_ID == 1)
 #define RTE_ENET_MII_TXER_PIN  P6_2
 #define RTE_ENET_MII_TXER_MODE XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT1
#else
 #error "Invalid TXER pin!"
#endif

//     <o> TXCLK (PHY Transmit clock) pin 
//       <0=>P5_10
//       <1=>P6_6
#define   RTE_ENET_MII_TXCLK_PIN_ID     0

#if (RTE_ENET_MII_TXCLK_PIN_ID == 0)
 #define RTE_ENET_MII_TXCLK_PIN  P5_10
#elif (RTE_ENET_MII_TXCLK_PIN_ID == 1)
 #define RTE_ENET_MII_TXCLK_PIN  P6_6
#else
 #error "Invalid TXCLK pin!"
#endif

//     <o> RXD0 (Receive data bit 0) pin 
//       <0=>P2_2
//       <1=>P0_2
//       <2=>P14_8
//       <3=>P5_0
#define   RTE_ENET_MII_RXD0_PIN_ID     0

#if (RTE_ENET_MII_RXD0_PIN_ID == 0)
 #define RTE_ENET_MII_RXD0_PIN  P2_2
#elif (RTE_ENET_MII_RXD0_PIN_ID == 1)
 #define RTE_ENET_MII_RXD0_PIN  P0_2
#elif (RTE_ENET_MII_RXD0_PIN_ID == 2)
 #define RTE_ENET_MII_RXD0_PIN  P14_8
#elif (RTE_ENET_MII_RXD0_PIN_ID == 3)
 #define RTE_ENET_MII_RXD0_PIN  P5_0
#else
 #error "Invalid RXD0 pin!"
#endif

//     <o> RXD1 (Receive data bit 1) pin 
//       <0=>P2_3
//       <1=>P0_3
//       <2=>P14_9
//       <3=>P5_1
#define   RTE_ENET_MII_RXD1_PIN_ID     0

#if (RTE_ENET_MII_RXD1_PIN_ID == 0)
 #define RTE_ENET_MII_RXD1_PIN  P2_3
#elif (RTE_ENET_MII_RXD1_PIN_ID == 1)
 #define RTE_ENET_MII_RXD1_PIN  P0_3
#elif (RTE_ENET_MII_RXD1_PIN_ID == 2)
 #define RTE_ENET_MII_RXD1_PIN  P14_9
#elif (RTE_ENET_MII_RXD1_PIN_ID == 3)
 #define RTE_ENET_MII_RXD1_PIN  P5_1
#else
 #error "Invalid RXD1 pin!"
#endif

//     <o> RXD2 (Receive data bit 2) pin 
//       <0=>P5_8
//       <1=>P6_4
#define   RTE_ENET_MII_RXD2_PIN_ID     0

#if (RTE_ENET_MII_RXD2_PIN_ID == 0)
 #define RTE_ENET_MII_RXD2_PIN  P5_8
#elif (RTE_ENET_MII_RXD2_PIN_ID == 1)
 #define RTE_ENET_MII_RXD2_PIN  P6_4
#else
 #error "Invalid RXD2 pin!"
#endif

//     <o> RXD3 (Receive data bit 3) pin 
//       <0=>P5_9
//       <1=>P6_3
#define   RTE_ENET_MII_RXD3_PIN_ID     0

#if (RTE_ENET_MII_RXD3_PIN_ID == 0)
 #define RTE_ENET_MII_RXD3_PIN  P5_9
#elif (RTE_ENET_MII_RXD3_PIN_ID == 1)
 #define RTE_ENET_MII_RXD3_PIN  P6_3
#else
 #error "Invalid RXD3 pin!"
#endif

//     <o> RXDV (Receive Data Valid) pin 
//       <0=>P2_5
//       <1=>P0_1
//       <2=>P15_9
//       <3=>P5_2
#define   RTE_ENET_MII_RXDV_PIN_ID     0

#if (RTE_ENET_MII_RXDV_PIN_ID == 0)
 #define RTE_ENET_MII_RXDV_PIN  P2_5
#elif (RTE_ENET_MII_RXDV_PIN_ID == 1)
 #define RTE_ENET_MII_RXDV_PIN  P0_1
#elif (RTE_ENET_MII_RXDV_PIN_ID == 2)
 #define RTE_ENET_MII_RXDV_PIN  P15_9
#elif (RTE_ENET_MII_RXDV_PIN_ID == 3)
 #define RTE_ENET_MII_RXDV_PIN  P5_2
#else
 #error "Invalid RXDV pin!"
#endif

//     <o> COL (Collision Detect) pin 
//       <0=>P2_15
//       <3=>P5_5
#define   RTE_ENET_MII_COL_PIN_ID     0

#if (RTE_ENET_MII_COL_PIN_ID == 0)
 #define RTE_ENET_MII_COL_PIN  P2_15
#elif (RTE_ENET_MII_COL_PIN_ID == 3)
 #define RTE_ENET_MII_COL_PIN  P5_5
#else
 #error "Invalid COL pin!"
#endif

